coq/aula9.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="pt" xml:lang="pt">
<head>
<!-- 2018-05-21 Mon 15:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Aula 9 - Polimorfismo em Coq</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Rafael Castro - rafaelcgs10.github.io/coq" />
<link rel="stylesheet" type="text/css" href="style.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Aula 9 - Polimorfismo em Coq</h1>

<div id="outline-container-orga6447a9" class="outline-2">
<h2 id="orga6447a9"><span class="section-number-2">1</span> Polimorfismo</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgc69cf98" class="outline-3">
<h3 id="orgc69cf98"><span class="section-number-3">1.1</span> Lista de booleanos</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Programas reais podem manipular listas não só de números, mas também de booleanos, strings, listas&#x2026;</li>
<li>Poderíamos simplemente definir um novo tipo de lista para cada tipo que desejassemos, como a lista de booleanos abaixo.</li>
<li>Obviamente, isso seria um grande gasto de tempo e linhas de código.</li>
</ul>
<div class="org-src-container">
<pre class="src src-coq"><span style="color: #F0DFAF; font-weight: bold;">Inductive</span> <span style="color: #93E0E3;">boollist</span> : <span style="color: #7CB8BB;">Type</span> :=
  | bool_nil : boollist
  | bool_cons : bool -&gt; boollist -&gt; boollist.
</pre>
</div>
</div>
</div>

<div id="outline-container-org51e3413" class="outline-3">
<h3 id="org51e3413"><span class="section-number-3">1.2</span> Tipo lista polimórfica</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Coq tem suporte a polimorfismo paramétrico em suas definições indutivas.</li>
<li>No polimorfismo paramétrico especifica-se uma variável de tipo que pode ser especializada (substituida) para os demais tipos.</li>
<li>No tipo <i>list</i> abaixo, a variável de tipo é o <i>X</i>.</li>
<li>Observe a existência de um argumento na definição do tipo.</li>
<li>A definição pode ser entendida com uma função entre tipos: do tipos <i>X</i> para o tipo <i>list X</i>.</li>
</ul>
<div class="org-src-container">
<pre class="src src-coq"><span style="color: #F0DFAF; font-weight: bold;">Inductive</span> <span style="color: #93E0E3;">list</span> (<span style="color: #DFAF8F;">X</span>:<span style="color: #7CB8BB;">Type</span>) : <span style="color: #7CB8BB;">Type</span> :=
  | nil : list X
  | cons : X -&gt; list X -&gt; list X.
<span style="color: #F0DFAF; font-weight: bold;">Check</span> list.

<span style="color: #5F7F5F;">(* </span><span style="color: #7F9F7F;">===&gt; list : Type -&gt; Type </span><span style="color: #5F7F5F;">*)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org0e2bf2b" class="outline-3">
<h3 id="org0e2bf2b"><span class="section-number-3">1.3</span> Utilizando tipos polimórficos (jeito ruim)</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>Os construtores <i>nil</i> e <i>cons</i> recebem um primeiro argumento que é o tipo ao qual o tipo <i>X</i> deve ser especializado.</li>
<li>O tipo de <i>nil</i> sem o argumento de tipo é um tipo quantificado para todo <i>X</i>. Idem <i>cons</i>.</li>
</ul>

<div class="org-src-container">
<pre class="src src-coq">
<span style="color: #F0DFAF; font-weight: bold;">Check</span> (nil nat).
<span style="color: #5F7F5F;">(* </span><span style="color: #7F9F7F;">===&gt; nil nat : list nat </span><span style="color: #5F7F5F;">*)</span>

<span style="color: #F0DFAF; font-weight: bold;">Check</span> (cons nat 3 (nil nat)).
<span style="color: #5F7F5F;">(* </span><span style="color: #7F9F7F;">===&gt; cons nat 3 (nil nat) : list nat </span><span style="color: #5F7F5F;">*)</span>

<span style="color: #F0DFAF; font-weight: bold;">Check</span> nil.
<span style="color: #5F7F5F;">(* </span><span style="color: #7F9F7F;">===&gt; nil : forall X : Type, list X </span><span style="color: #5F7F5F;">*)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org89e2f61" class="outline-3">
<h3 id="org89e2f61"><span class="section-number-3">1.4</span> Função <i>repeat</i> novamente!</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>Podemos definir as mesmas funções de lista de naturais, mas de maneira polimórfica.</li>
<li>Note que há um novo argumento <i>(X : Type)</i>!</li>
</ul>

<div class="org-src-container">
<pre class="src src-coq"><span style="color: #F0DFAF; font-weight: bold;">Fixpoint</span> <span style="color: #BFEBBF; background-color: #3F3F3F;">repeat</span> (<span style="color: #DFAF8F;">X</span> : <span style="color: #7CB8BB;">Type</span>) (<span style="color: #DFAF8F;">x</span>:X) (<span style="color: #DFAF8F;">count</span> : nat) : list X :=
  <span style="color: #7CB8BB;">match</span> count <span style="color: #7CB8BB;">with</span>
  | 0 =&gt; nil X
  | S count' =&gt; cons X x (<span style="color: #BFEBBF; background-color: #3F3F3F;">repeat</span> X x count')
  <span style="color: #7CB8BB;">end</span>.

<span style="color: #F0DFAF; font-weight: bold;">Example</span> <span style="color: #93E0E3;">test_repeat1</span> :
  <span style="color: #BFEBBF; background-color: #3F3F3F;">repeat</span> nat 4 2 = cons nat 4 (cons nat 4 (nil nat)).
<span style="color: #F0DFAF; font-weight: bold;">Proof</span>. <span style="color: #BFEBBF;">reflexivity</span>.  <span style="color: #F0DFAF; font-weight: bold;">Qed</span>.
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org8915c02" class="outline-2">
<h2 id="org8915c02"><span class="section-number-2">2</span> Inferência de tipos</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgba16d55" class="outline-3">
<h3 id="orgba16d55"><span class="section-number-3">2.1</span> A função <i>repeat</i> de novo novamente.</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Vamos definir <i>repeat'</i> sem assinar o tipo de <i>X</i> com <i>Type</i>.</li>
<li>Coq é capaz de inferir os tipos.</li>
<li>É recomendável assinar os tipos, apesar de não ser necessário sempre. Pois, assinaturas de tipos servem como um documentação do uso da função e <i>sanity check</i>.</li>
</ul>

<div class="org-src-container">
<pre class="src src-coq"><span style="color: #F0DFAF; font-weight: bold;">Fixpoint</span> <span style="color: #93E0E3;">repeat'</span> X x count : list X :=
  <span style="color: #7CB8BB;">match</span> count <span style="color: #7CB8BB;">with</span>
  | 0        =&gt; nil X
  | S count' =&gt; cons X x (repeat' X x count')
  <span style="color: #7CB8BB;">end</span>.
</pre>
</div>
</div>
</div>

<div id="outline-container-org5deae5f" class="outline-3">
<h3 id="org5deae5f"><span class="section-number-3">2.2</span> Inferência no corpo da definição</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>A inferência de tipos pode ser utilizada no corpo da definição.</li>
</ul>

<div class="org-src-container">
<pre class="src src-coq"><span style="color: #F0DFAF; font-weight: bold;">Fixpoint</span> <span style="color: #93E0E3;">repeat''</span> X x count : list X :=
  <span style="color: #7CB8BB;">match</span> count <span style="color: #7CB8BB;">with</span>
  | 0        =&gt; nil _
  | S count' =&gt; cons _ x (repeat'' _ x count')
  <span style="color: #7CB8BB;">end</span>.
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfd523af" class="outline-3">
<h3 id="orgfd523af"><span class="section-number-3">2.3</span> Inferência no uso da função</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>Coq pode inferir o tipo da função com base no tipo dos argumentos utilizados.</li>
</ul>

<div class="org-src-container">
<pre class="src src-coq"><span style="color: #F0DFAF; font-weight: bold;">Definition</span> <span style="color: #93E0E3;">list123'</span> :=
  cons _ 1 (cons _ 2 (cons _ 3 (nil _))).
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org0c5fa3d" class="outline-2">
<h2 id="org0c5fa3d"><span class="section-number-2">3</span> Argumentos implícitos</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgf332f9d" class="outline-3">
<h3 id="orgf332f9d"><span class="section-number-3">3.1</span> Argumentos implícitos</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>Ter que escrever, mesmo que não especificando, o argumento referente ao tipo faz Coq parecer verboso.</li>
<li>Há como não escrever os argumentos refentes aos tipos, para isso é necessário especifica-los como implícitos.</li>
<li>O comando <i>Arguments</i> recebe uma função (ou construtor) e, entre chaves, os seus argumentos que serão feitos implícitos</li>
<li>Assim, não é necessário mencionar tipos durante o uso da função (ou construtor).</li>
</ul>

<div class="org-src-container">
<pre class="src src-coq"><span style="color: #F0DFAF; font-weight: bold;">Arguments</span> nil {X}.
<span style="color: #F0DFAF; font-weight: bold;">Arguments</span> cons {X} _ _.
<span style="color: #F0DFAF; font-weight: bold;">Arguments</span> <span style="color: #BFEBBF; background-color: #3F3F3F;">repeat</span> {X} x count.

<span style="color: #F0DFAF; font-weight: bold;">Definition</span> <span style="color: #93E0E3;">list123''</span> := cons 1 (cons 2 (cons 3 nil)).
</pre>
</div>
</div>
</div>

<div id="outline-container-org81a119c" class="outline-3">
<h3 id="org81a119c"><span class="section-number-3">3.2</span> Definições com argumentos implícitos</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>Alternativamente, podemos declarar argumentos como implícitos ao marca-los entre chaves.</li>
</ul>

<div class="org-src-container">
<pre class="src src-coq"><span style="color: #F0DFAF; font-weight: bold;">Inductive</span> <span style="color: #93E0E3;">list'</span> {<span style="color: #DFAF8F;">X</span>:<span style="color: #7CB8BB;">Type</span>} : <span style="color: #7CB8BB;">Type</span> :=
  | nil' : list'
  | cons' : X -&gt; list' -&gt; list'.

<span style="color: #F0DFAF; font-weight: bold;">Fixpoint</span> <span style="color: #93E0E3;">repeat'''</span> {<span style="color: #DFAF8F;">X</span> : <span style="color: #7CB8BB;">Type</span>} (<span style="color: #DFAF8F;">x</span>:X) 
                      (<span style="color: #DFAF8F;">count</span>:nat) : list X :=
  <span style="color: #7CB8BB;">match</span> count <span style="color: #7CB8BB;">with</span>
  | 0        =&gt; nil
  | S count' =&gt; cons x (repeat''' x count')
  <span style="color: #7CB8BB;">end</span>.
</pre>
</div>
</div>
</div>

<div id="outline-container-org5ba6ed4" class="outline-3">
<h3 id="org5ba6ed4"><span class="section-number-3">3.3</span> Definições com argumentos implícitos 2</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">
<pre class="src src-coq"><span style="color: #F0DFAF; font-weight: bold;">Fixpoint</span> <span style="color: #93E0E3;">app</span> {<span style="color: #DFAF8F;">X</span> : <span style="color: #7CB8BB;">Type</span>} (<span style="color: #DFAF8F;">l1 l2</span> : list X) : (list X) :=
  <span style="color: #7CB8BB;">match</span> l1 <span style="color: #7CB8BB;">with</span>
  | nil      =&gt; l2
  | cons h t =&gt; cons h (app t l2)
  <span style="color: #7CB8BB;">end</span>.

<span style="color: #F0DFAF; font-weight: bold;">Fixpoint</span> <span style="color: #93E0E3;">rev</span> {<span style="color: #DFAF8F;">X</span>:<span style="color: #7CB8BB;">Type</span>} (<span style="color: #DFAF8F;">l</span>:list X) : list X :=
  <span style="color: #7CB8BB;">match</span> l <span style="color: #7CB8BB;">with</span>
  | nil      =&gt; nil
  | cons h t =&gt; app (rev t) (cons h nil)
  <span style="color: #7CB8BB;">end</span>.

<span style="color: #F0DFAF; font-weight: bold;">Fixpoint</span> <span style="color: #93E0E3;">length</span> {<span style="color: #DFAF8F;">X</span> : <span style="color: #7CB8BB;">Type</span>} (<span style="color: #DFAF8F;">l</span> : list X) : nat :=
  <span style="color: #7CB8BB;">match</span> l <span style="color: #7CB8BB;">with</span>
  | nil =&gt; 0
  | cons _ l' =&gt; S (length l')
  <span style="color: #7CB8BB;">end</span>.
</pre>
</div>
</div>
</div>

<div id="outline-container-org7f6fa07" class="outline-3">
<h3 id="org7f6fa07"><span class="section-number-3">3.4</span> Tornar explicíto argumentos implícitos</h3>
<div class="outline-text-3" id="text-3-4">
<ul class="org-ul">
<li>Quando um valor tem argumentos implícitos os mesmo não aparecem quantificados.</li>
<li>É possível tornar explícito arugmentos implícitos com o prefixo <i>@</i>.</li>
</ul>
<div class="org-src-container">
<pre class="src src-coq"><span style="color: #F0DFAF; font-weight: bold;">Check</span> nil.
<span style="color: #9FC59F;">(** </span>
<span style="color: #9FC59F;">nil : list </span><span style="color: #9FC59F;">?X</span>
<span style="color: #9FC59F;">where</span>
<span style="color: #9FC59F;">?X</span><span style="color: #9FC59F;"> : [ |- Type] *)</span>

<span style="color: #F0DFAF; font-weight: bold;">Check</span> <span style="color: #BFEBBF;">@</span>nil.
<span style="color: #9FC59F;">(**</span>
<span style="color: #9FC59F;">@</span><span style="color: #9FC59F;">nil : forall X : Type, list X *)</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-orgb84dd39" class="outline-3">
<h3 id="orgb84dd39"><span class="section-number-3">3.5</span> Notações novamente</h3>
<div class="outline-text-3" id="text-3-5">
<div class="org-src-container">
<pre class="src src-coq"><span style="color: #F0DFAF; font-weight: bold;">Notation</span> <span style="color: #CC9393;">"x :: y"</span> := (cons x y)
                     (<span style="color: #7CB8BB;">at</span> level 60, <span style="color: #BFEBBF; background-color: #3F3F3F;">right</span> associativity).
<span style="color: #F0DFAF; font-weight: bold;">Notation</span> <span style="color: #CC9393;">"[ ]"</span> := nil.
<span style="color: #F0DFAF; font-weight: bold;">Notation</span> <span style="color: #CC9393;">"[ x ; .. ; y ]"</span> := (cons x .. (cons y []) ..).
<span style="color: #F0DFAF; font-weight: bold;">Notation</span> <span style="color: #CC9393;">"x ++ y"</span> := (app x y)
                     (<span style="color: #7CB8BB;">at</span> level 60, <span style="color: #BFEBBF; background-color: #3F3F3F;">right</span> associativity).

<span style="color: #F0DFAF; font-weight: bold;">Definition</span> <span style="color: #93E0E3;">list123'''</span> := [1; 2; 3].
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgfccbf7c" class="outline-2">
<h2 id="orgfccbf7c"><span class="section-number-2">4</span> Pares polimórficos</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org5504005" class="outline-3">
<h3 id="org5504005"><span class="section-number-3">4.1</span> Tipo dupla polimórifa</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>Podemos definir duplas polimórficas seguindo o mesmo padrão de listas polimórficas.</li>
<li>Também podemos utilizar o mecanismo de notação nos tipos.</li>
</ul>

<div class="org-src-container">
<pre class="src src-coq"><span style="color: #F0DFAF; font-weight: bold;">Inductive</span> <span style="color: #93E0E3;">prod</span> (<span style="color: #DFAF8F;">X Y</span> : <span style="color: #7CB8BB;">Type</span>) : <span style="color: #7CB8BB;">Type</span> :=
| pair : X -&gt; Y -&gt; prod X Y.

<span style="color: #F0DFAF; font-weight: bold;">Arguments</span> pair {X} {Y} _ _.

<span style="color: #F0DFAF; font-weight: bold;">Notation</span> <span style="color: #CC9393;">"( x , y )"</span> := (pair x y).

<span style="color: #F0DFAF; font-weight: bold;">Notation</span> <span style="color: #CC9393;">"X * Y"</span> := (prod X Y) : type_scope.
</pre>
</div>
</div>
</div>

<div id="outline-container-org3fac437" class="outline-3">
<h3 id="org3fac437"><span class="section-number-3">4.2</span> Projeções polimórficas</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>As projeções dos elementos de uma dupla são funções polimórficas.</li>
</ul>

<div class="org-src-container">
<pre class="src src-coq"><span style="color: #F0DFAF; font-weight: bold;">Definition</span> <span style="color: #93E0E3;">fst</span> {<span style="color: #DFAF8F;">X Y</span> : <span style="color: #7CB8BB;">Type</span>} (<span style="color: #DFAF8F;">p</span> : X * Y) : X :=
  <span style="color: #7CB8BB;">match</span> p <span style="color: #7CB8BB;">with</span>
  | (x, y) =&gt; x
  <span style="color: #7CB8BB;">end</span>.

<span style="color: #F0DFAF; font-weight: bold;">Definition</span> <span style="color: #93E0E3;">snd</span> {<span style="color: #DFAF8F;">X Y</span> : <span style="color: #7CB8BB;">Type</span>} (<span style="color: #DFAF8F;">p</span> : X * Y) : Y :=
  <span style="color: #7CB8BB;">match</span> p <span style="color: #7CB8BB;">with</span>
  | (x, y) =&gt; y
  <span style="color: #7CB8BB;">end</span>.
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb8e3190" class="outline-3">
<h3 id="orgb8e3190"><span class="section-number-3">4.3</span> A função <i>combine</i> (ou <i>zip</i>)</h3>
<div class="outline-text-3" id="text-4-3">
<ul class="org-ul">
<li>A função <i>combine</i> é conhecida em muitas linguagens funcionais como <i>zip</i>. Ela recebe duas listas e junta ambas numa lista de duplas.</li>
</ul>

<div class="org-src-container">
<pre class="src src-coq"><span style="color: #F0DFAF; font-weight: bold;">Fixpoint</span> <span style="color: #93E0E3;">combine</span> {<span style="color: #DFAF8F;">X Y</span> : <span style="color: #7CB8BB;">Type</span>} (<span style="color: #DFAF8F;">lx</span> : list X) (<span style="color: #DFAF8F;">ly</span> : list Y)
           : list (X*Y) :=
  <span style="color: #7CB8BB;">match</span> lx, ly <span style="color: #7CB8BB;">with</span>
  | [], _ =&gt; []
  | _, [] =&gt; []
  | x :: tx, y :: ty =&gt; (x, y) :: (combine tx ty)
  <span style="color: #7CB8BB;">end</span>.
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 21/05/2018</p>
<p class="author">Author: Rafael Castro - rafaelcgs10.github.io/coq</p>
<p class="date">Created: 2018-05-21 Mon 15:10</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
